def enter(i):
    if i == '\n':
        return "\n"
    else:
        return


dictionary = {'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.',
              'ж': '...-', 'з': '--..', 'и': '..', 'й': '.---', 'к': '-.-', 'л': '.-..',
              'м': '--', 'н': '-.', 'о': '---', 'п': '.--.', 'р': '.-.', 'с': '...',
              'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.', 'ч': '---.',
              'ш': '----', 'щ': '--.-', 'ъ': '-..-', 'ь': '-..-', 'ы': '-.--', 'э': '..-..', 'ю': '..--',
              'я': '.-.-', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....',
              '7': '--...', '8': '---..', '9': '----.', '0': '-----', '.': '.....', ',': '.-.-.-', ';': '-.-.-.',
              ':': '---...', '?': '..--..', '!': '--..--', '-': '_', ' ': ' ', '"': '.-..-.',
              '(': '-.--.-', ')': '-.--.-', '/': '-..-.'}
try:
    file_1 = open("input.txt", "rt", encoding="utf-8")
    file_2 = open("result.txt", "w", encoding="utf-8")
    w = [dictionary.get(i.lower(), i.lower()) for i in file_1.read()]
    file_2.write("|".join(w))
    file_1.close()
    file_2.close()
except UnicodeEncodeError:
    print('Ошибка кодировки')
except FileNotFoundError:
    print('Нет файла')
except KeyError:
    print('Неправильный формат ввода')
